In [57]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [58]:
df = pd.read_csv("../datasets/cars.csv")
print(df.shape)
df.head()

(8128, 5)

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [59]:
df["brand"].nunique()

32

In [60]:
df["brand"].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Land                6
Force               6
Isuzu               5
Ambassador          4
Kia                 4
MG                  3
Daewoo              3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [61]:
df["owner"].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

In [62]:
# df = pd.get_dummies(df, columns=["fuel", "owner"])

In [63]:
df

        brand  km_driven    fuel                 owner  selling_price
0      Maruti     145500  Diesel           First Owner         450000
1       Skoda     120000  Diesel          Second Owner         370000
2       Honda     140000  Petrol           Third Owner         158000
3     Hyundai     127000  Diesel           First Owner         225000
4      Maruti     120000  Petrol           First Owner         130000
...       ...        ...     ...                   ...            ...
8123  Hyundai     110000  Petrol           First Owner         320000
8124  Hyundai     119000  Diesel  Fourth & Above Owner         135000
8125   Maruti     120000  Diesel           First Owner         382000
8126     Tata      25000  Diesel           First Owner         290000
8127     Tata      25000  Diesel           First Owner         290000

[8128 rows x 5 columns]

In [64]:
df.shape

(8128, 5)

#### Addition of dummy columns has introduced multi-colinearity to in our data set. Therefore, we must drop the redundant columns

In [65]:
# df = pd.get_dummies(df, columns=["fuel", "owner"], drop_first=True)
# df.sample(5)

In [66]:
df.shape

(8128, 5)

### But, pandas is not ideal for doing this as dataframes are volatile and their structure will be random after each call of get_dummies. Therefore, we'll use scikit learn class for this

In [67]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(
    df.drop(columns=["selling_price"]),
    df["selling_price"],
    train_size=0.7,
    random_state=42
)

In [68]:
from sklearn.preprocessing import OneHotEncoder

ohe = OneHotEncoder(drop="first")
X_train_new = ohe.fit_transform(X_train[["fuel", "owner"]]).toarray()

In [69]:
X_test_new = ohe.transform(X_test[["fuel", "owner"]]).toarray()

In [70]:
np.hstack((X_train[["brand", "km_driven"]].values, X_train_new)).shape

(5689, 9)

#### OHE for huge number of classes

In [75]:
cnt = df["brand"].value_counts()
type(cnt)

pandas.core.series.Series

In [79]:
df["brand"].nunique()
threshold = 100

np.int64(81)

In [81]:
repl = cnt[cnt <= threshold].index

In [82]:
pd.get_dummies(df["brand"].replace(repl, "others"), drop_first=True)

,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,others
0,False,False,False,False,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,True,False,False,False,False
2,False,False,True,False,False,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,False,False,False,True,False,False,False,False,False,False,False,False
8124,False,False,False,True,False,False,False,False,False,False,False,False
8125,False,False,False,False,False,True,False,False,False,False,False,False
8126,False,False,False,False,False,False,False,False,True,False,False,False
8127,False,False,False,False,False,False,False,False,True,False,False,False